quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'print("Hello"[::-1])',
        'options': ['olleH', 'Hello', '-1', 'Ошибка синтаксиса'],
        'correct_option': 0
    },
    {
        'question': 'Какой оператор используется для проверки существования ключа в словаре?',
        'options': ['in', '==', 'is', 'not in'],
        'correct_option': 0
    },
    {
        'question': 'Что означает термин «лямбда-функция» в Python?',
        'options': ['Обычная именованная функция', 'Анонимная функция, используемая однократно', 'Метод классового экземпляра', 'Глобальная переменная'],
        'correct_option': 0
    },
    {
        'question': 'Какой метод возвращает количество уникальных символов строки?',
        'options': ['.count()', '.len()', 'set().__len__()', '.index()'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных представляет собой кортеж в Python?',
        'options': ['Изменяемый массив', 'Неизменяемая последовательность', 'Ассоциативный массив', 'Объект класса'],
        'correct_option': 0
    },
    {
        'question': 'Как называется специальная конструкция, позволяющая задать диапазон значений в циклах?',
        'options': ['range()', 'list()', 'tuple()', 'dict()'],
        'correct_option': 0
    },
    {
        'question': 'Какой метод позволяет получить длину строки или последовательности?',
        'options': ['.length()', '.len()', '.size()', '.total()'],
        'correct_option': 0
    },
    {
        'question': 'Что обозначают квадратные скобки [] в списке?',
        'options': ['Создание нового списка', 'Индексация элемента массива', 'Инкапсуляция значения', 'Преобразование в кортеж'],
        'correct_option': 0
    },
]